//1.4 배열에 중복 요소가 있는지 검사하기
#include <stdio.h>

int has_duplicate_elem(int A[], int n) {
    for(int i=0; i<n-1; i++) {
        for(int j=i+1; j<n; j++) { //한자리 밀어도 값 전부 비교 가능함. 무방향 그래프의 인접행렬은 상/하삼각행렬만 알아도 됐던 것처럼
            /* 한 자리 뒤에서 시작하는 이유: A[0] A[1], A[1] A[0]같은 중복 상황을 피하기 위함.
            (A[1]A[2], A[2]A[1]깉은 상황이 계속 나올텐데, 아예 한자리 뒤랑 비교하면 그럴 필요가 없음.
            게다가 A[0] A[0]으로 자기 자신을 중복 처리해버리는 경우도 생김.. (2026.10.5 다시 확인)이게 여기 쓰인게 맞나 근데?*/ 
            if(A[i] == A[j]) return 1;
        }
    } return 0;
}

int main(void) { //main이 1이든 0이든 리턴하니까 그냥 표준은 int main(void). 매개변수가 없어서 void인데, 매개변수는 함수를 호출하는 순간 값이 들어온다 생각하셈
    int a[8] = { 32, 14, 5, 17, 23, 9, 11, 4 };
    int b[8] = { 32, 14, 5, 17, 23, 14, 11, 4 };

    printf("A: 중복된 요소 %s\n", has_duplicate_elem(a,8) ? "있음" : "없음"); //삼항 연산자를 여기서 써버림..
    printf("B: 중복된 요소 %s\n", has_duplicate_elem(b,8) ? "있음" : "없음");

    return 0;
}